# Creación de un Dataframe

In [1]:
# Ejercicio 1
# Mediante el uso de las librerías NumPy y Pandas desarrolle un código en Python que sea capaz de generar el siguiente

In [6]:
# Importación de la librería numpy
import numpy
# creación de un arreglo
arreglo = numpy.array ([[1,2,3] , [4,5,6], [7,8,9]])

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [7]:
import numpy as np
arreglo = np.array ([[1,2,3] , [4,5,6], [7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [8]:
# el imput se puede convertir a un formato tabular usando la librería Pandas

import pandas as pd
# Creación de un dataframe
df=pd.DataFrame(arreglo)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
# Modificación de las columnas del dataframe
df=pd.DataFrame(data= arreglo, index = ["A", "B", "C"], columns = ["D", "E", "F"] )
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [11]:
# Sección superior (encabezado)
# para extraer filas

df.head(2)

   D  E  F
A  1  2  3
B  4  5  6

In [12]:
# información de cada columna
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int32
 1   E       3 non-null      int32
 2   F       3 non-null      int32
dtypes: int32(3)
memory usage: 60.0+ bytes

In [13]:
# dimensión del dataframe
df.shape

(3, 3)

In [14]:
# cálculo de estadisticas de la tabla
df.describe()

         D    E    F
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [16]:
# nombres de las columnas
df.columns

Index(['D', 'E', 'F'], dtype='object')

In [17]:
# nombre de los renglones
df.index

Index(['A', 'B', 'C'], dtype='object')

In [20]:
# adición de un nuevo renglón al dataframe

df.loc ["G"] = [11, 12, 13]
df

    D   E   F
A   1   2   3
B   4   5   6
C   7   8   9
G  11  12  13

In [21]:
# adición de una nueva columna al dataframe
df["H"] = [17, 16, 15,14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [22]:
# Extracción de columnas del dataframe
df2 = df[["E","H"]]
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

In [ ]:
# Extracción de renglones del dataframe

df3=df.iloc[0:2]

In [23]:
# Cambio de nombres en TODAS las columnas
df.columns= ["Columna1", "Columna2", "Columna3","Columna4"]
df

   Columna1  Columna2  Columna3  Columna4
A         1         2         3        17
B         4         5         6        16
C         7         8         9        15
G        11        12        13        14

In [24]:
# Cambio de nombre de ALGUNAS columnas
df.rename(columns= {"Columna1":"Column1", "Columna2":"Column2"}, inplace =True)
df

   Column1  Column2  Columna3  Columna4
A        1        2         3        17
B        4        5         6        16
C        7        8         9        15
G       11       12        13        14

In [25]:
# Cambio de nombre de renglones
df.rename(index= {"A":"Dato1", "B":"Dato2"}, inplace =True)
df

       Column1  Column2  Columna3  Columna4
Dato1        1        2         3        17
Dato2        4        5         6        16
C            7        8         9        15
G           11       12        13        14

In [26]:
# Ordenamiento de Dataframes
df4= df.sort_values("Columna4", ascending= True)
df4

       Column1  Column2  Columna3  Columna4
G           11       12        13        14
C            7        8         9        15
Dato2        4        5         6        16
Dato1        1        2         3        17

In [27]:
# Verificación de condiciones en Dataframe
df["Column2"]>5

Dato1    False
Dato2    False
C         True
G         True
Name: Column2, dtype: bool

In [28]:
# para extraer registros que cumplen con la condición anterior
df[df["Column2"]>5]

   Column1  Column2  Columna3  Columna4
C        7        8         9        15
G       11       12        13        14

In [31]:
# para extraer condiciones múltiples
condicion1 = df["Column1"] > 1
condicion2 = df["Column1"] < 12
df[condicion1 & condicion2]

       Column1  Column2  Columna3  Columna4
Dato2        4        5         6        16
C            7        8         9        15
G           11       12        13        14

In [37]:
# Ejercicio 2

# Mediante el uso de las librerías NumPy y Pandas desarrolle un código en Python que sea capaz de generar el siguiente 
# Dataframe: ver PPT

arreglo = np.array([["Bella","Labrador","Cafe",56,24,"2013-07-01"],["Charlie","Poodle","Negro",43,24,"2016-09-16"],
                    ["Lucy","Chow Chow","Café",46,24,"2014-08-25"],["Cooper","Shnauzer","Gris",49,17,"2011-12-11"],
                    ["Bernie","San Bernardo","Blanco",77,74,"2018-02-27"]])
arreglo

array([['Bella', 'Labrador', 'Cafe', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow Chow', 'Café', '46', '24', '2014-08-25'],
       ['Cooper', 'Shnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27']],
      dtype='<U12')

In [38]:
df= pd.DataFrame(data=arreglo, columns= ["Nombre", "Raza", "Color","Altura_cm","Peso_kg", "Fecha_nac"])
df

    Nombre          Raza   Color Altura_cm Peso_kg   Fecha_nac
0    Bella      Labrador    Cafe        56      24  2013-07-01
1  Charlie        Poodle   Negro        43      24  2016-09-16
2     Lucy     Chow Chow    Café        46      24  2014-08-25
3   Cooper      Shnauzer    Gris        49      17  2011-12-11
4   Bernie  San Bernardo  Blanco        77      74  2018-02-27

In [39]:
# Extraiga aquellos registros de los perros cuya fecha de nacimiento es anterior al 1 de Enero del 2015

df2=df[df["Fecha_nac"] < "2015-01-01"]
df2

   Nombre       Raza Color Altura_cm Peso_kg   Fecha_nac
0   Bella   Labrador  Cafe        56      24  2013-07-01
2    Lucy  Chow Chow  Café        46      24  2014-08-25
3  Cooper   Shnauzer  Gris        49      17  2011-12-11

In [40]:
#Extraiga aquellos registros de los perros cuya estatura es mayor a 50 cms.

# tenemos que convertir los números de texto a caracter numérico

df["Altura_cm"] = df["Altura_cm"].astype(int)

In [41]:
df[df["Altura_cm"]>50]

   Nombre          Raza   Color  Altura_cm Peso_kg   Fecha_nac
0   Bella      Labrador    Cafe         56      24  2013-07-01
4  Bernie  San Bernardo  Blanco         77      74  2018-02-27

In [42]:
# Agregue una nueva columna a este Dataframe que calcule el índice de masa muscular (IMM) para cada perro, el cual está 
# dado por la fórmula:

df["Peso_kg"] = df["Peso_kg"].astype(int)
df["IMM"] = df["Peso_kg"]/(df["Altura_cm"]/100)**2
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_nac         IMM
0    Bella      Labrador    Cafe         56       24  2013-07-01   76.530612
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892
2     Lucy     Chow Chow    Café         46       24  2014-08-25  113.421550
3   Cooper      Shnauzer    Gris         49       17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255

In [43]:
# otras manipulaciones...
# Extracción de las columnas Nombre, raza, IMM
df2= df[["Nombre","Raza","IMM"]]
df2

    Nombre          Raza         IMM
0    Bella      Labrador   76.530612
1  Charlie        Poodle  129.799892
2     Lucy     Chow Chow  113.421550
3   Cooper      Shnauzer   70.803832
4   Bernie  San Bernardo  124.810255

In [44]:
# ordenamos la información de IMM de manera ascendente

df2=df2.sort_values("IMM", ascending=True)
df2

    Nombre          Raza         IMM
3   Cooper      Shnauzer   70.803832
0    Bella      Labrador   76.530612
2     Lucy     Chow Chow  113.421550
4   Bernie  San Bernardo  124.810255
1  Charlie        Poodle  129.799892